---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearPerpendicular
source: html/97e009e5-68a4-0ad5-a7c1-4e1e9be22d15.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearPerpendicular Property

"Shear perpendicular to grain"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamShearPerpendicular { get; }
```